{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["conv2d_5", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 28, 28, 1], "name": "input_1", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "filters": 32, "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "filters": 1, "padding": "same", "kernel_constraint": null, "kernel_size": [3, 3], "activation": "sigmoid", "trainable": true, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}]}, "keras_version": "2.0.2"}